updates in the documentation
